Environment: prod. Pipeline Stage: prod
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm05"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_backup_protected_vm.VM_VAULT["vmxwcdm06"] will be created
  + resource "azurerm_backup_protected_vm" "VM_VAULT" {
      + backup_policy_id    = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.RecoveryServices/vaults/rsv-xwc-core-001/backupPolicies/Policy-3-Month-Backup"
      + id                  = (known after apply)
      + protection_state    = (known after apply)
      + recovery_vault_name = "rsv-xwc-core-001"
      + resource_group_name = "rg-xwc-core-001"
      + source_vm_id        = (known after apply)
    }

  # module.device-manager.azurerm_mssql_elasticpool.elastic_pool will be updated in-place
  ~ resource "azurerm_mssql_elasticpool" "elastic_pool" {
        id                             = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-app-001/providers/Microsoft.Sql/servers/sqlxwcdmsrv003/elasticPools/xwc-prod-pool"
        name                           = "xwc-prod-pool"
        tags                           = {
            "ApplicationName"  = "VelocityLandingZone"
            "BusinessUnit"     = "MOJ"
            "CostCentre"       = "MOJ"
            "OwnerName"        = "rob.ashworth@justice.gov.uk"
            "ProjectStartDate" = "05102020"
            "RequesterName"    = "rob.ashworth@justice.gov.uk"
            "ServiceLevel"     = "Gold"
        }
        # (8 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 200 -> 300
            name     = "StandardPool"
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwcdm05"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcdm05"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-app-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.34"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.device-manager.azurerm_network_interface.NIC["vmxwcdm06"] will be created
  + resource "azurerm_network_interface" "NIC" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "uksouth"
      + mac_address                   = (known after apply)
      + name                          = "nic1-vmxwcdm06"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-xwc-app-001"
      + tags                          = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.192.30.35"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/876eef88-ec3d-47db-b101-ec6f9daefb65/resourceGroups/rg-xwc-core-001/providers/Microsoft.Network/virtualNetworks/vnet-xwc-core-001/subnets/snet-xwc-core-001"
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm05"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm05"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-app-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold1"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "2",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm05"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm05"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine.VM["vmxwcdm06"] will be created
  + resource "azurerm_virtual_machine" "VM" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = false
      + id                               = (known after apply)
      + license_type                     = "Windows_Server"
      + location                         = "uksouth"
      + name                             = "vmxwcdm06"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-xwc-app-001"
      + tags                             = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
          + "UpdateClass"      = "Gold2"
        }
      + vm_size                          = "Standard_D8s_V4"
      + zones                            = [
          + "3",
        ]

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = "https://stxwcbootdiag003.blob.core.windows.net/"
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = "Empty"
          + disk_size_gb              = 256
          + lun                       = 0
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "data-vmxwcdm06"
          + write_accelerator_enabled = false
        }

      + storage_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-datacenter-gensecond"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Premium_LRS"
          + name                      = "os-vmxwcdm06"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm05"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "IaaSAntimalware"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                "AntimalwareEnabled": true,
                "RealtimeProtectionEnabled": "true",
                "ScheduledScanSettings": {
                    "isEnabled": "true",
                    "day": "7",
                    "time": "120",
                    "scanType": "Quick"
                },
                "Exclusions": {
                    "Extensions": "",
                    "Paths": "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database",
                    "Processes": "NTUser.dat*"
                 }
              }
        EOT
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.AVEXT["vmxwcdm06"] will be created
  + resource "azurerm_virtual_machine_extension" "AVEXT" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "IaaSAntimalware"
      + publisher                   = "Microsoft.Azure.Security"
      + settings                    = <<-EOT
            {
                "AntimalwareEnabled": true,
                "RealtimeProtectionEnabled": "true",
                "ScheduledScanSettings": {
                    "isEnabled": "true",
                    "day": "7",
                    "time": "120",
                    "scanType": "Quick"
                },
                "Exclusions": {
                    "Extensions": "",
                    "Paths": "C:\\Windows\\SoftwareDistribution\\Datastore;C:\\Windows\\SoftwareDistribution\\Datastore\\Logs;C:\\Windows\\Security\\Database",
                    "Processes": "NTUser.dat*"
                 }
              }
        EOT
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                        = "IaaSAntimalware"
      + type_handler_version        = "1.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm05"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AADLoginForWindows"
      + publisher                   = "Microsoft.Azure.ActiveDirectory"
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                        = "AADLoginForWindows"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.device-manager.azurerm_virtual_machine_extension.login_for_windows["vmxwcdm06"] will be created
  + resource "azurerm_virtual_machine_extension" "login_for_windows" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AADLoginForWindows"
      + publisher                   = "Microsoft.Azure.ActiveDirectory"
      + tags                        = {
          + "ApplicationName"  = "VelocityLandingZone"
          + "BusinessUnit"     = "MOJ"
          + "CostCentre"       = "MOJ"
          + "OwnerName"        = "rob.ashworth@justice.gov.uk"
          + "ProjectStartDate" = "05102020"
          + "RequesterName"    = "rob.ashworth@justice.gov.uk"
          + "ServiceLevel"     = "Gold"
        }
      + type                        = "AADLoginForWindows"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

Plan: 10 to add, 1 to change, 0 to destroy.